#Return if any of the bit is 1,else it returns 0

a=10
b=5
print(a|b)

'''
Bitwise OR:
যখন দুটি বিটের মধ্যে যেকোনো একটি বিটও 1 হয়, তখন ফলাফল হবে 1।
অন্যথায়, 0 হবে।
a = 10 → বাইনারি রূপ: 1010
b = 5 → বাইনারি রূপ: 0101

এখন Bitwise OR অপারেশন করা হবে:
      1010
     |0101
    -------
      1111 → 15
'''

a=10
b=5
print (bin(a|b))
#0b1111
#এখানে 0b নির্দেশ করে যে এটি বাইনারি সংখ্যা
# bin() ফাংশনটি একটি সংখ্যাকে বাইনারি (binary) ফরম্যাটে রূপান্তর করে।

'''
🎯   OR অপারেশন:
      0 | 0 = 0
      0 | 1 = 1
      1 | 0 = 1
      1 | 1 = 1


মনে রাখার শর্টকাট 🚀:
👉 কমপক্ষে একজন ভালো হলেই পাশ
👉 দুইজনই খারাপ হলে ফেল

'''